Tekla.Structures.Model.LogicalWeld
The LogicalWeld class represents a group of welds in the model.
A logical weld contains a list of children welds.
The primary properties need to be the same in all the children welds.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Weld Weld1 = new Weld();
Weld Weld2 = new Weld();
Weld1.TypeBelow = Weld.WeldTypeEnum.WELD_TYPE_SLOT;
Weld2.TypeBelow = Weld.WeldTypeEnum.WELD_TYPE_SEAM;
LogicalWeld LogicalWeld = new LogicalWeld(Weld1);
LogicalWeld.AddWeld(Weld2);
LogicalWeld.Insert();
LogicalWeld.SetMainWeld(Weld2);
LogicalWeld.RemoveWeld(Weld1);
LogicalWeld.Modify();
LogicalWeld.Explode();
}
}

Tekla.Structures.Model.LogicalWeld._LogicalWeldList
List of children welds of this Logical Weld.

Tekla.Structures.Model.LogicalWeld.#ctor(Tekla.Structures.Model.BaseWeld)
Creates a new logical weld instance.
MainWeld: The main weld for the logical weld.

Tekla.Structures.Model.LogicalWeld.AddWeld(Tekla.Structures.Model.BaseWeld)
Adds a weld to the logical weld.
Weld: The weld to be added.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.GetMainWeld
Returns the main weld of the logical weld.
Returns: The main weld of the logical weld.

Tekla.Structures.Model.LogicalWeld.SetMainWeld(Tekla.Structures.Model.BaseWeld)
Sets the main weld for the logical weld.
Weld: The weld to be set as the main weld.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.RemoveWeld(Tekla.Structures.Model.BaseWeld)
Removes a weld from the logical weld.
Weld: The weld to be removed.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.Explode
Removes the logical weld from the model but not the children welds.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.Insert
Inserts the logical weld into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.Select
Selects a logical weld from the model database. The logical weld identifier must be set.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.Select(Tekla.Structures.Model.BaseWeld)
Selects the logical weld that a child weld belongs to.
ChildWeld: A child weld whose logical weld we want to select.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.Modify
Modifies the existing logical weld in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.Delete
Deletes the logical weld instance with the given identifier
from the model database and also the children welds.
Returns: True on success.

Tekla.Structures.Model.LogicalWeld.ToStruct(Tekla.Structures.ModelInternal.dotWeld_t@)
converts to struct a weld
p: weld

Tekla.Structures.Model.LogicalWeld.AddWeldCheck(Tekla.Structures.Model.BaseWeld)
Checks that Weld can be added to the Logical Weld.
Returns: Returns true on success.

Tekla.Structures.Model.LogicalWeld.GetMainWeldId
Returns the Main Weld Identifier of this Logical Weld.
Returns:
Returns the Main Weld Identifier of this Logical Weld.
Returns 0 if there are no welds in this Logical Weld.

Tekla.Structures.Model.LogicalWeld.CopyPrimaryProperties(Tekla.Structures.Model.BaseWeld)
Copies the attributes of the Main Weld to the
attributes of the Logical Weld (Logical Weld
attributes = Main Weld attributes).
Returns: Returns true on success.